package OOP기초;

public class OOP {

	public static void main(String[] args) {

		
		// Object Oriented Programming
		
		// 클래스
		// : 객체를 만들기 위해서 만드는
		// : 나만의 자료형 설계도면
		// -> field, method로 구성
		
		// 오브젝트
		// : 해당 도면을 가지고 실제로 만들어 내는 것
		// : 메모리에 할당한다.
		
		// 객체지향프로그래밍 특징4가지
		// ->캡슐화, 상속, 추상화, 다향성
		// 캡슐화
		// : 필드, 메소드를 하나로 묶어서 저장 + 정보은닉
		// 상속
		// : 기존의 어떤 클래스, 다른 사람이 만들어놓은,
		// : 자료형이 있었을 때, 그 기능을 그대로 이어받음
		// 추상화
		// : 어떤 데이터를 만드려고 봤을 때,
		// : 공통된 특징을 추출해서 밑그림을 그리는 것
		// ex) String name;
		// 다형성
		// : 같은 기능을 호출하더라도,
		// : 객체에 따라서 다르게 동작할 수 있다.
		
	}

}
